# Set Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Entity..::..Set Method
Entity Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Set<(Of <<'(FieldType>)>>)(String, FieldType) | Stores the value of the field in the entity. |
| Set<(Of <<'(FieldType>)>>)(Field, FieldType) | Stores the value of the field in the entity. |
| Set<(Of <<'(FieldType>)>>)(String, FieldType, ForgeTypeId) | Stores the value of the field in the entity. |
| Set<(Of <<'(FieldType>)>>)(Field, FieldType, ForgeTypeId) | Stores the value of the field in the entity. |

# See Also
Entity Class
Entity Members
Autodesk.Revit.DB.ExtensibleStorage Namespace